In [101]:
import pandas as pd
print(pd.Series([1,2,3,4,5,6,7,8,9,10]))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [102]:
print(pd.Series([13.4,432.3,32.4,332.5]))

0     13.4
1    432.3
2     32.4
3    332.5
dtype: float64

In [103]:
print(pd.Series(["english","maths","science","hindi","marathi"],index = ["1st","2nd","3rd","4th","5th"]))

1st    english
2nd      maths
3rd    science
4th      hindi
5th    marathi
dtype: object

In [104]:
data = {'name':"Suyash",'age':28,"mobile":9820101995}
d = pd.Series(data)
print(d)

name          Suyash
age               28
mobile    9820101995
dtype: object

In [105]:
d['name']

'Suyash'

In [106]:
d['age']

28

In [107]:
d['mobile']

9820101995

CREATING DATAFRAME

In [108]:
data = {'Name':['Suyash','Suraj','Siraj','Aishwarya','Vaibhav','Sayali','Arpita'],
       'Age':[28,25,24,26,23,27,30],
       'Marks':[100,90,92,96,97,95,94]}
df = pd.DataFrame(data)
df

        Name  Age  Marks
0     Suyash   28    100
1      Suraj   25     90
2      Siraj   24     92
3  Aishwarya   26     96
4    Vaibhav   23     97
5     Sayali   27     95
6     Arpita   30     94

In [109]:
df['hobby'] = ['cricket','trading','gym','singing','travelling','dancing','swimming']
df

        Name  Age  Marks       hobby
0     Suyash   28    100     cricket
1      Suraj   25     90     trading
2      Siraj   24     92         gym
3  Aishwarya   26     96     singing
4    Vaibhav   23     97  travelling
5     Sayali   27     95     dancing
6     Arpita   30     94    swimming

In [110]:
df.set_index(['Name'],inplace = True)
df

           Age  Marks       hobby
Name
Suyash      28    100     cricket
Suraj       25     90     trading
Siraj       24     92         gym
Aishwarya   26     96     singing
Vaibhav     23     97  travelling
Sayali      27     95     dancing
Arpita      30     94    swimming

In [111]:
df['Age']

Name
Suyash       28
Suraj        25
Siraj        24
Aishwarya    26
Vaibhav      23
Sayali       27
Arpita       30
Name: Age, dtype: int64

In [112]:
df['Marks']

Name
Suyash       100
Suraj         90
Siraj         92
Aishwarya     96
Vaibhav       97
Sayali        95
Arpita        94
Name: Marks, dtype: int64

In [113]:
df['hobby']

Name
Suyash          cricket
Suraj           trading
Siraj               gym
Aishwarya       singing
Vaibhav      travelling
Sayali          dancing
Arpita         swimming
Name: hobby, dtype: object

In [114]:
df.loc['Suyash']

Age           28
Marks        100
hobby    cricket
Name: Suyash, dtype: object

In [115]:
df.loc[(df.Marks > 95)]

           Age  Marks       hobby
Name
Suyash      28    100     cricket
Aishwarya   26     96     singing
Vaibhav     23     97  travelling

In [116]:
df.iloc[0]

Age           28
Marks        100
hobby    cricket
Name: Suyash, dtype: object

In [117]:
df.iloc[0:4]

           Age  Marks    hobby
Name
Suyash      28    100  cricket
Suraj       25     90  trading
Siraj       24     92      gym
Aishwarya   26     96  singing

In [118]:
df.iloc[0:2,0:2]

        Age  Marks
Name
Suyash   28    100
Suraj    25     90

In [119]:
df.iloc[:,0:1]

           Age
Name
Suyash      28
Suraj       25
Siraj       24
Aishwarya   26
Vaibhav     23
Sayali      27
Arpita      30

In [120]:
df.drop(['Siraj'],axis = 0) # Removing Row

           Age  Marks       hobby
Name
Suyash      28    100     cricket
Suraj       25     90     trading
Aishwarya   26     96     singing
Vaibhav     23     97  travelling
Sayali      27     95     dancing
Arpita      30     94    swimming

In [121]:
df.drop(['hobby'],axis = 1) # Removing Column

           Age  Marks
Name
Suyash      28    100
Suraj       25     90
Siraj       24     92
Aishwarya   26     96
Vaibhav     23     97
Sayali      27     95
Arpita      30     94

In [122]:
cast = pd.read_csv('cast.csv')

In [123]:
cast.describe()

               year             n
count  75001.000000  46035.000000
mean    1990.536473     16.814359
std       26.748233     24.695616
min     1912.000000      1.000000
25%     1974.000000      4.000000
50%     2002.000000     10.000000
75%     2012.000000     21.000000
max     2023.000000    701.000000

In [124]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75001 entries, 0 to 75000
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      75000 non-null  object
 1   year       75001 non-null  int64
 2   name       75001 non-null  object
 3   type       75001 non-null  object
 4   character  75001 non-null  object
 5   n          46035 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.4+ MB

In [125]:
cast.shape

(75001, 6)

In [126]:
cast.head(5)

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [127]:
cast.tail(5)

,title,year,name,type,character,n
74996,Mia fora kai ena... moro,2011,Penelope Anastasopoulou,actress,Popi voulkanizater,11.0
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NaN
74998,Festival of Lights,2010,Zoe Anastassiou,actress,Guidance Counselor,20.0
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN
75000,Fugitive Pieces,2007,Anastassia Anastassopoulou,actress,Laundry Girl,25.0

In [128]:
cast.isnull().sum()

title            1
year             0
name             0
type             0
character        0
n            28966
dtype: int64

In [129]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
74996,Mia fora kai ena... moro,2011,Penelope Anastasopoulou,actress,Popi voulkanizater,11.0
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NaN
74998,Festival of Lights,2010,Zoe Anastassiou,actress,Guidance Counselor,20.0
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN
75000,Fugitive Pieces,2007,Anastassia Anastassopoulou,actress,Laundry Girl,25.0

In [130]:
cast.index

RangeIndex(start=0, stop=75001, step=1)

In [131]:
len(cast.index)

75001

In [132]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [133]:
cast['name'].value_counts()

name
Ernie Adams                   431
Richard Alexander             288
Victor Adamson                264
Eddie Acuff                   254
Fred Aldrich                  220
                             ...
Eric M. Aldrich                 1
Don Aldrich                     1
Derrick Aldrich                 1
Davie Aldrich                   1
Anastassia Anastassopoulou      1
Name: count, Length: 29319, dtype: int64

In [134]:
print(cast['n'].sum())
print(cast['n'].max())
print(cast['n'].min())
print(cast['n'].std())
print(cast['n'].mean())
print(cast['n'].median())
print(cast['n'].mode())

774049.0
701.0
1.0
24.69561649662169
16.814358640165093
10.0
0    1.0
Name: n, dtype: float64

In [135]:
cast.iloc[:,0:2]

                          title  year
0                Closet Monster  2015
1               Suuri illusioni  1985
2           Battle of the Sexes  2017
3          Secret in Their Eyes  2015
4                    Steve Jobs  2015
...                         ...   ...
74996  Mia fora kai ena... moro  2011
74997         The Magician King  2004
74998        Festival of Lights  2010
74999                Toxic Tutu  2016
75000           Fugitive Pieces  2007

[75001 rows x 2 columns]

In [136]:
df = pd.read_csv('student_marks.csv')
df

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,05-25-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,05-25-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       10 non-null     object
 1   Gender     10 non-null     object
 2   DOB        10 non-null     object
 3   Maths      10 non-null     int64
 4   Physics    10 non-null     int64
 5   Chemistry  10 non-null     int64
 6   English    10 non-null     int64
 7   Biology    10 non-null     int64
 8   Economics  10 non-null     int64
 9   History    10 non-null     int64
 10  Civics     10 non-null     int64
dtypes: int64(8), object(3)
memory usage: 1012.0+ bytes

In [138]:
import datetime
dt = datetime.datetime.now()
dt

datetime.datetime(2024, 8, 1, 13, 3, 19, 446757)

In [139]:
df['DOB'] = pd.to_datetime(df['DOB'],errors='coerce')
df['DOB']

0   1988-05-04
1   1987-04-05
2   1989-05-25
3   1990-12-08
4   1989-02-09
5   1988-05-04
6   1987-04-05
7   1989-05-25
8   1990-12-08
9   1989-02-09
Name: DOB, dtype: datetime64[ns]

In [140]:
df.loc[4:]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77

In [141]:
df.loc[2:,'DOB':]

,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
2,1989-05-25,25,54,89,76,95,87,56,74
3,1990-12-08,78,96,86,63,54,89,75,45
4,1989-02-09,58,96,78,46,96,77,83,53
5,1988-05-04,45,87,52,89,55,89,87,52
6,1987-04-05,55,64,61,58,75,58,64,61
7,1989-05-25,54,76,87,56,25,56,76,87
8,1990-12-08,55,63,89,75,78,75,63,89
9,1989-02-09,96,46,77,83,58,83,46,77

In [142]:
df.loc[df['Gender'] == 'M','Name']

0      John
1    Suresh
2    Ramesh
7    Ritesh
9    Mukesh
Name: Name, dtype: object

In [143]:
df.loc[df['Gender'] == 'F',['Gender','Name']]

  Gender      Name
3      F   Jessica
4      F  Jennifer
5      F      Annu
6      F     pooja
8      F     Farha

In [144]:
df.loc[(df["Gender"] == "M") & (df["Name"] == "Mukesh")]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77

In [145]:
df.loc[(~(df["Gender"] == "F") & (df["Name"] == "Mukesh"))]

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77

In [146]:
df['Name'].replace("John","Suyash")

0      Suyash
1      Suresh
2      Ramesh
3     Jessica
4    Jennifer
5        Annu
6       pooja
7      Ritesh
8       Farha
9      Mukesh
Name: Name, dtype: object

In [147]:
df['Total'] = df['Maths'] + df['Physics']+df['Chemistry']+df['English']+df['Biology']+df['Economics']+df['History']+df['Civics']
df['Total']

0    470
1    524
2    556
3    586
4    587
5    556
6    496
7    517
8    587
9    566
Name: Total, dtype: int64

In [148]:
df['Percentage'] = df['Total']/8
df['Percentage']

0    58.750
1    65.500
2    69.500
3    73.250
4    73.375
5    69.500
6    62.000
7    64.625
8    73.375
9    70.750
Name: Percentage, dtype: float64

In [149]:
def Grade(Percentage):
    if Percentage > 65: return 'A'
    elif(Percentage >= 40 and Percentage <=50): return 'B'
    else: return 'C'
df['Grade'] = df['Percentage'].apply(Grade)
df

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,Total,Percentage,Grade
0,John,M,1988-05-04,55,45,56,87,21,52,89,65,470,58.750,C
1,Suresh,M,1987-04-05,75,96,78,64,90,61,58,2,524,65.500,A
2,Ramesh,M,1989-05-25,25,54,89,76,95,87,56,74,556,69.500,A
3,Jessica,F,1990-12-08,78,96,86,63,54,89,75,45,586,73.250,A
4,Jennifer,F,1989-02-09,58,96,78,46,96,77,83,53,587,73.375,A
5,Annu,F,1988-05-04,45,87,52,89,55,89,87,52,556,69.500,A
6,pooja,F,1987-04-05,55,64,61,58,75,58,64,61,496,62.000,C
7,Ritesh,M,1989-05-25,54,76,87,56,25,56,76,87,517,64.625,C
8,Farha,F,1990-12-08,55,63,89,75,78,75,63,89,587,73.375,A
9,Mukesh,M,1989-02-09,96,46,77,83,58,83,46,77,566,70.750,A

In [150]:
grp = df.groupby('Grade').count()
grp

,Name,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,Total,Percentage
Grade,,,,,,,,,,,,,
A,7,7,7,7,7,7,7,7,7,7,7,7,7
C,3,3,3,3,3,3,3,3,3,3,3,3,3

In [151]:
grpmaths = df['Maths'].agg(['mean','max','min','count'])
grpmaths

mean     59.6
max      96.0
min      25.0
count    10.0
Name: Maths, dtype: float64

In [152]:
minmaths = df['Maths'].min()
minmaths

25

In [153]:
maxmaths = df['Maths'].max()
maxmaths

96

In [154]:
meanmaths = df['Maths'].mean()
meanmaths

59.6

In [155]:
medianmaths = df['Maths'].median()
medianmaths

55.0

In [156]:
modemaths = df['Maths'].mode()
modemaths

0    55
Name: Maths, dtype: int64